Revit 2024 API
PanelScheduleData.UpdateLoadSummary Method
 Update the load summary section
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void UpdateLoadSummary()
Visual Basic
Public Sub UpdateLoadSummary
Visual C++
public:
void UpdateLoadSummary()
See Also
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace